<a href="https://colab.research.google.com/github/Ar-Anik/Machine_Learning/blob/main/Concat_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas

Bangladesh_Weather = pandas.DataFrame({
    'City' : ['Dhaka', 'Chittagong', 'khulna'],
    'Temperature' : [35, 32, 28],
    'Humidity' : [60, 72, 81]
})

Bangladesh_Weather

         City  Temperature  Humidity
0       Dhaka           35        60
1  Chittagong           32        72
2      khulna           28        81

In [ ]:
Russia_Weather = pandas.DataFrame({
    'City' : ['Moscow', 'Kazan', 'Samara'],
    'Temperature' : [21, 14, 19],
    'Humidity' : [68, 65, 75]
})

Russia_Weather

     City  Temperature  Humidity
0  Moscow           21        68
1   Kazan           14        65
2  Samara           19        75

In [ ]:
# Concat Two Data Frame

new_data = pandas.concat([Bangladesh_Weather, Russia_Weather])

new_data

         City  Temperature  Humidity
0       Dhaka           35        60
1  Chittagong           32        72
2      khulna           28        81
0      Moscow           21        68
1       Kazan           14        65
2      Samara           19        75

In [ ]:
# continuous Index

new_data = pandas.concat([Bangladesh_Weather, Russia_Weather], ignore_index=True)

new_data

         City  Temperature  Humidity
0       Dhaka           35        60
1  Chittagong           32        72
2      khulna           28        81
3      Moscow           21        68
4       Kazan           14        65
5      Samara           19        75

In [ ]:
new_data = pandas.concat([Bangladesh_Weather, Russia_Weather], keys = ['Bangladesh', 'Russia'])

new_data

                    City  Temperature  Humidity
Bangladesh 0       Dhaka           35        60
           1  Chittagong           32        72
           2      khulna           28        81
Russia     0      Moscow           21        68
           1       Kazan           14        65
           2      Samara           19        75

In [ ]:
new_data.loc['Russia']

     City  Temperature  Humidity
0  Moscow           21        68
1   Kazan           14        65
2  Samara           19        75

In [ ]:
# Temperature Data

Tem_data = pandas.DataFrame({
    'City' : ['Dhaka', 'Chittagong', 'khulna'],
    'Temperature' : [35, 32, 28]
})

Tem_data

         City  Temperature
0       Dhaka           35
1  Chittagong           32
2      khulna           28

In [ ]:
# Windspeed Data

Win_data = pandas.DataFrame({
    'City' : ['Dhaka', 'Chittagong', 'khulna'],
    'Windspeed' : [7, 12, 9]
})

Win_data

         City  Windspeed
0       Dhaka          7
1  Chittagong         12
2      khulna          9

In [ ]:
# Concat Two Data Frame

data = pandas.concat([Tem_data, Win_data])

data

         City  Temperature  Windspeed
0       Dhaka         35.0        NaN
1  Chittagong         32.0        NaN
2      khulna         28.0        NaN
0       Dhaka          NaN        7.0
1  Chittagong          NaN       12.0
2      khulna          NaN        9.0

In [ ]:
# axis keyword

data = pandas.concat([Tem_data, Win_data], axis = 0)

data

         City  Temperature  Windspeed
0       Dhaka         35.0        NaN
1  Chittagong         32.0        NaN
2      khulna         28.0        NaN
0       Dhaka          NaN        7.0
1  Chittagong          NaN       12.0
2      khulna          NaN        9.0

In [ ]:
data = pandas.concat([Tem_data, Win_data], axis = 1)

data

         City  Temperature        City  Windspeed
0       Dhaka           35       Dhaka          7
1  Chittagong           32  Chittagong         12
2      khulna           28      khulna          9

In [ ]:
data = pandas.concat([Tem_data, Win_data], axis = 2)

data

ValueError: ignored

In [3]:
# Again Make Data Frame for missing concept

Tem_data = pandas.DataFrame({
    'City' : ['Dhaka', 'Chittagong', 'khulna'],
    'Temperature' : [35, 32, 28]
})

Tem_data

         City  Temperature
0       Dhaka           35
1  Chittagong           32
2      khulna           28

In [5]:
Win_data = pandas.DataFrame({
    'City' : [ 'khulna','Chittagong'],
    'Windspeed' : [9, 12]
})

Win_data

         City  Windspeed
0      khulna          9
1  Chittagong         12

In [7]:
data = pandas.concat([Tem_data, Win_data], axis = 1)

data

         City  Temperature        City  Windspeed
0       Dhaka           35      khulna        9.0
1  Chittagong           32  Chittagong       12.0
2      khulna           28         NaN        NaN

In [9]:
# Above in row 0 two city are not same Dhaka and Khulna For this use index key word

Tem_data = pandas.DataFrame({
    'City' : ['Dhaka', 'Chittagong', 'khulna'],
    'Temperature' : [35, 32, 28]
}, index = [0, 1, 2])


Win_data = pandas.DataFrame({
    'City' : [ 'khulna','Chittagong'],
    'Windspeed' : [9, 12]
}, index = [2, 1])


print(Tem_data, '\n\n', Win_data)

         City  Temperature
0       Dhaka           35
1  Chittagong           32
2      khulna           28

          City  Windspeed
2      khulna          9
1  Chittagong         12

In [10]:
data = pandas.concat([Tem_data, Win_data], axis = 1)

data

         City  Temperature        City  Windspeed
0       Dhaka           35         NaN        NaN
1  Chittagong           32  Chittagong       12.0
2      khulna           28      khulna        9.0

In [13]:
# Concat a series with a DataFrame

s = pandas.Series(['Dry', 'Rain', 'Humid'], name = 'Event')

s

0      Dry
1     Rain
2    Humid
Name: Event, dtype: object

In [15]:
new_data = pandas.concat([Tem_data, s], axis = 1)

new_data

         City  Temperature  Event
0       Dhaka           35    Dry
1  Chittagong           32   Rain
2      khulna           28  Humid